Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: ཐབས་ལ་མཁས་པ་གང་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཐབས་མཁས་པ་དེ་དག་ཐོབ་པར་འགྱུར་བར་སྦྱིན་པ་འདིའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བ་འདི་ནི་བསྔོ་བ་དང་པོའོ།
en: The first dedication prayer is: ‘I plant the roots of merit of this generosity so that I may attain skills in methods, those skills in methods by which the buddha bhagavāns attained the highest, complete enlightenment of buddhahood.’

source: །དགེ་བའི་བཤེས་གཉེན་གང་དག་ལས་ཐབས་མཁས་པ་ཐོས་ཤིང་འཛིན་པར་འགྱུར་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་འཆང་བ་དང་ཀློག་པར་འགྱུར་བ་དང་། གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་དགེ་བའི་བཤེས་གཉེན་དེ་དག་དང་བདག་རྟག་ཏུ་འགྲོགས་པར་གྱུར་ཅིག་ཅེས་དེ་ལྟར་སྦྱིན་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བ་འདི་ནི་བསྔོ་བ་གཉིས་པའོ།
en: “The second dedication prayer is: ‘I plant the roots of merit of this generosity so that I may listen to those skills in methods from kalyāṇamitras, remember them, understand them, possess them, and recite them, and so that I will always be in the company of those kalyāṇamitras who will attain the highest, complete enlightenment of buddhahood.’

source: །ལོངས་སྤྱོད་ཐོབ་པ་གང་འཇིག་རྟེན་ཐམས་ཅད་འཚོ་བར་འགྱུར་བའི་ལོངས་སྤྱོད་ཐོབ་པ་དེ་དག་དང་བདག་ཕྲད་པར་གྱུར་ཅིག་ཅེས་དེ་ལྟར་སྦྱིན་པའི་དགེ་བའི་རྩ་བ་དེས་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བ་འདི་ནི་བསྔོ་བ་གསུམ་པའོ།
en: “The third dedication prayer is: ‘I plant the roots of merit of this generosity so that all may obtain the requisites that sustain life in the world, and so that these requisites may come together for me.’

source: །བདག་གི་ལུས་གྲུབ་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་ཕན་གདགས་པ་དང་། ཟང་ཟིང་གི་ཕན་གདགས་པ་དང་ཕན་གདགས་པ་གཉིས་ཀྱིས་ཕན་འདོགས་པར་འགྱུར་བའི་བདག་གི་ལུས་གྲུབ་པར་གྱུར་ཅིག་ཅེས་སྦྱིན་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བ་འདི་ནི་བསྔོ་བ་བཞི་པ་སྟེ།
en: “The fourth dedication prayer is: ‘I plant the roots of merit of this generosity so that I may attain an existence in which I take care of beings, taking care of them in two ways: taking care of them through the Dharma and taking care of them through material things.’

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསྔོ་བ་འདི་བཞིས་དགེ་བའི་རྩ་བ་རྣམས་བསྔོ་བར་བྱའོ།
en: “Young man, the bodhisattva mahāsattvas dedicate those roots of merit through those four prayers of dedication.

source: །གཞན་ཡང་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་བྱུང་བ་ཡང་རུང་ཁྱིམ་པ་ཡང་རུང་སྟེ། ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ལ་གཡོ་མེད་པས་བསྟེན་པར་བྱ། བསྙེན་པར་བྱ། རིམ་གྲོ་བྱའོ། །དེ་ལ་གཡོ་མེད་པ་དེ་ནི་ཏིང་ངེ་འཛིན་འདི་འཛིན་པའི་དགེ་སློང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ན་བར་གྱུར་ཅིང་ནད་མི་བཟད་པས་བཏབ་པར་གྱུར་པ་ལ་རང་གི་ཤ་དང་ཁྲག་གིས་ཀྱང་དགེ་སློང་དེ་ན་བ་དེ་ལས་བསླང་བར་སྤྲོ་བར་བྱའོ།
en: “Moreover, young man, bodhisattva mahāsattvas who yearn for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, whether they are homeless renunciants or householders, should sincerely serve, provide for, and attend upon a bodhisattva mahāsattva who has correct conduct, good qualities, and wisdom. If that bodhisattva mahāsattva bhikṣu who possesses this samādhi were to become ill, afflicted by a powerful illness, then they should eagerly cure him of the illness with their own flesh and blood.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་གཡོ་བ་མེད་ཅིང་འཇིགས་པ་མེད་པས་རང་གི་ཤ་དང་ཁྲག་ཀྱང་ཡོངས་སུ་བཏང་སྟེ། དགེ་སློང་ཆོས་སྨྲ་བ་ན་བ་ལས་བསླང་བར་བྱའོ། །གཞོན་ནུ་རྣམ་གྲངས་དེས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གཞོན་ནུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། ཡངས་པ། ཚད་མེད་པ།
en: Young man, the bodhisattva mahāsattvas who with the perfect higher motivation yearn for this samādhi and wish to attain quickly the highest, complete enlightenment of perfect buddhahood should fearlessly and confidently give even their own flesh and blood so that the dharmabhāṇaka bhikṣu will be healed from his illness.

source: དཔག་ཏུ་མེད་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: “Young man, in a past countless eon—numerous, incalculable, countless eons ago—at that time and in those days, there was a tathāgata, an arhat, a perfectly enlightened buddha perfect in wisdom and conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of devas and humans, the Bhagavān Buddha Acintya­praṇidhāna­viśeṣa­samudgata­rāja who had appeared in the world.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྨོན་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ། ཁྱད་པར་དུ་འཕགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། གཞོན་ནུ་སྨོན་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ་ཁྱད་པར་དུ་འཕགས་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་གང་གི་ཉིན་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཉི་མ་མ་འདས་པར་སངས་རྒྱས་ཀྱི་འཕྲུལ་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་མངོན་པར་སྤྲུལ་ནས་སེམས་ཅན་ཚད་མེད་པ་འདུལ་བ་བྱས་ཏེ།
en: “Young man, before the end of the day on which he attained the highest, complete enlightenment of perfect buddhahood, he manifested incalculable, innumerable buddha emanations and guided countless beings, establishing them in the arhathood in which all outflows have ceased, and he established countless beings in irreversible progress toward the highest, complete enlightenment.

source: ཟག་པ་ཟད་པ་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་ནས་སེམས་ཅན་ཚད་མེད་པ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་ནས་ཉི་མ་དེ་མ་འདས་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: And then, before that day had ended, he passed into nirvāṇa.

source: །བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་དམ་པའི་ཆོས་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་གནས་པར་གྱུར་ཏོ།
en: “The Dharma of that Bhagavān who had passed into nirvāṇa remained for a hundred thousand quintillion years.

source: །གཞོན་ནུ་བཅོམ་ལྡན་འདས་སྨོན་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ་ཁྱད་པར་དུ་འཕགས་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བསྟན་པ་ནུབ་པའི་དུས་ཀྱི་ཚེ་ལྔ་བརྒྱ་ཐ་མར་གྱུར་པ་ན་དགེ་སློང་དམིགས་པའི་ལྟ་བ་ཅན་མང་པོ་བྱུང་སྟེ།
en: “Young man, in the last five hundred years before the Dharma of Bhagavān Acintya­praṇidhāna­viśeṣa­samudgata­rāja finally came to an end, there were many bhikṣus who held the view of objective existence.

source: དེ་དག་འདི་ལྟ་བུའི་མདོ་སྡེ་ལ་མི་སྲེད་མི་མོས་ཤིང་ཕྱིར་ཟློག་པར་བྱེད།
en: They had no yearning, no aspiration for a sūtra like this and opposed it and attacked it.

source: སྤོང་བར་བྱེད་དེ། མདོ་སྡེ་འདི་ལྟ་བུ་འཛིན་པའི་དགེ་སློང་དག་ལ་ཡང་གནོད་པར་བྱེད་ཅིང་སྲོག་ཀྱང་གཅོད་པར་བྱེད་དེ།
en: They harmed and even killed the bhikṣus who possessed this sūtra.

source: རྙེད་པ་དང་བཀུར་སྟི་ལ་ཆགས་པ་དེ་དག་གིས་མདོ་སྡེ་འདི་ལྟ་བུ་འཛིན་པའི་དགེ་སློང་སྟོང་སྲོག་བཅད་པར་གྱུར་ཏོ།
en: They had attachment to gain and honor and therefore they killed thousands of bhikṣus who possessed a sūtra like this.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཡེ་ཤེས་ཀྱི་སྟོབས་ཞེས་བྱ་བ་འཛམ་བུའི་གླིང་ལ་དབང་བ།
en: “Young man, at that time and in those days, King Jñānabala ruled over Jambudvīpa.

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ། སྔོན་གྱི་སྨོན་ལམ་ཕུན་སུམ་ཚོགས་པ་ཞིག་བྱུང་སྟེ།
en: He possessed the Dharma and had appeared because of his perfect prayers in previous lifetimes.

source: གཞོན་ནུ་ཡང་དེའི་ཚེ་དེའི་དུས་ན་འཛམ་བུའི་གླིང་འདིར་དགེ་སློང་ཡང་དག་བློ་གྲོས་ཞེས་བྱ་བ་ཏིང་ངེ་འཛིན་འདི་འཛིན་པ།
en: “Young man, at that time and in those days, in this Jambudvīpa there was a bhikṣu named Bhūtamati who possessed this sūtra.

source: ཆོས་སྨྲ་བ་རྒྱལ་པོ་དེའི་ཕོ་བྲང་དུ་འགྲོ་ཞིང་། དགེ་བའི་བཤེས་གཉེན་བྱེད་པ། ཕན་པར་འདོད་པ། སྙིང་བརྩེ་བ་དོན་དུ་འདོད་པ་ཞིག་བྱུང་སྟེ།
en: That dharmabhāṇaka went to the king’s palace and became a kalyāṇamitra who was altruistic, was compassionate, and wished to benefit others.

source: རྒྱལ་པོ་དེ་ཡང་དེ་ལ་རྒྱུན་མི་ཆད་པར་བལྟ་བས་མི་ངོམས་ཏེ་རྟག་ཏུ་འདོད་པར་གྱུར་ཏོ།
en: The king never tired of gazing upon him and always longed to see him.

source: །དེ་ཡང་བསྟན་པ་དང་ཆོས་ཀྱི་གཏམ་བྱ་བ་དང་ཉེ་བར་འགྲོ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་ཡོངས་སུ་དྲི་བ་དང་། གཟུང་བ་དང་ཚིག་གིས་གོ་བར་བྱེད་ནུས་ཤིང་དགེ་སློང་ཆོས་སྨྲ་བ་དེ།
en: He came to him for teaching and for discussions on the Dharma. He honored him, asked him questions, obtained answers, and was able to understand what was spoken.

source: སེམས་ཅན་དག་གི་གཡོ་བ་དང་སྤྱོད་ལམ་དང་མོས་པ་དང་ཁམས་དང་བག་ཆགས་ལ་མཁས་ཏེ།
en: “That dharmabhāṇaka bhikṣu was wise in the behavior, conduct, aspirations, natures, and propensities of beings.

source: སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་དང་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱི་རིམ་པ་ཤེས་ཤིང་ཁམས་དང་བག་ཆགས་ལ་ཡང་མཁས།
en: He knew the extent of the powers, strengths, and diligence of beings.

source: བདེན་པ་དང་མཚམས་སྦྱར་བ་ལ་ཡང་མཁས།
en: He was wise in natures and propensities. He was wise in implying the truth.

source: མཚམས་དབྲལ་བ་དང་ཚིག་གི་ལན་གཏན་ལ་དབབ་པ་ལ་ཡང་མཁས།
en: He was also wise in giving answers without implied meaning.

source: སྤོབས་པ་ཟབ་ཅིང་སེམས་ཅན་ཐམས་ཅད་འདུལ་བའི་ཆོ་ག་ལ་ཡང་མཁས།
en: He had profound eloquence and was wise in the ways of guiding all beings.

source: གསོང་པོར་སྨྲ་ཞིང་བཞིན་ལ་ཁྲོ་གཉེར་མེད་པ།
en: He spoke sincerely. His face was free of frowns.

source: སེམས་ཆེན་པོར་གྱུར་པ་ལ་གནས་པ།
en: He remained in a state of greatness of mind.

source: སྙིང་རྗེ་ཆེན་པོ་ལ་བརྩོན་པ།
en: He was dedicated to great compassion.

source: ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མ་ནོན་པ་ཡིན་ནོ།
en: He could not be defeated by any opponent.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱི་བུ་མོ་སྐྱེས་ནས་ལོ་བཅུ་དྲུག་ལོན་པ། བྱད་བཞིན་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ།
en: “Young man, at that time and in those days, King Jñānabala’s daughter was sixteen years old and she was beautiful, attractive, and charming.

source: ཁ་དོག་བཟང་ཞིང་རྒྱས་པའི་མཆོག་དང་ལྡན་པ་ཡེ་ཤེས་ལྡན་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: She had a lovely complexion, and was magnificent. Her name was Jñānāvatī.

source: དེའི་སློབ་དཔོན་ནི་དགེ་སློང་ཡང་དག་བློ་གྲོས་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: The bhikṣu Bhūtamati was her ācārya.

source: དགེ་བའི་ཆོས་རྣམས་ལ་ཡང་དག་པར་སྟོན་པ། ཡང་དག་པར་གཟེངས་སྟོད་པ། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱེད་པ།
en: He taught her the virtuous qualities, extolled them, delighted in them, and made her develop them.

source: ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་ཡིན་ནོ། །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་བརླ་གཉིས་ལ་འབྲུམ་བུ་མེ་དབལ་ནག་པོ་ཆེན་པོ་གསོ་དཀའ་ཞིང་སྨན་དཀོན་པ་ཞིག་བྱུང་སྟེ། ན་བ་དེ་སྨན་པ་དག་གིས་སྤངས་པར་གྱུར་ཏོ།
en: “Young man, at that time and in those days, the dharmabhāṇaka bhikṣu developed widespread, black erysipelas on both his thighs, which did not respond to treatment and had no known cure, so that the physicians gave up trying to heal him.

source: །དེ་ནས་རྒྱལ་པོ་ཡེ་ཤེས་ཀྱི་སྟོབས་བཙུན་མོའི་འཁོར་དང་བཅས་པ་སྲས་དང་སྲས་མོ་དང་ཞབས་འབྲིང་བར་བཅས་པ་དགེ་སློང་དེ་ན་བར་རིག་ནས་རབ་ཏུ་ངུ་ཞིང་མཆི་མ་བྱུང་ངོ་།
en: King Jñānabala with his harem, sons, daughters, and attendants, on learning that the bhikṣu was ill, wept and shed tears.

source: །བུད་མེད་བརྒྱད་ཁྲིར་བཅས་པ་དང་གྲོང་དང་གྲོང་ཁྱེར་གྱི་མི་རྣམས་སུ་བཅས་པ་དང་ཡུལ་འཁོར་བ་དང་གྲོང་འདབ་པ་དང་ཡུལ་གྱི་མི་དང་རྩིས་པ་དང་བློན་པོ་དང་བློན་པོ་ཆེན་པོ་དང་སྒོ་བ་དང་འཁོར་རྣམས་སུ་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དགེ་སློང་དེ་ན་བར་ཐོས་ནས་རབ་ཏུ་ངུ་ཞིང་མཆི་མ་འབྱིན་ཏེ། དགེ་སློང་འདི་འཆི་བའི་དུས་བྱེད་པར་གྱུར་ཏ་རེ་ཞེས་སྐད་འཛེར་ཏོ།
en: “Eighty thousand women, the inhabitants of the cities and towns, the people of the kingdom, the people of the market towns and the regions, the astrologers, ministers, and prime ministers, and the doorkeepers and attendants, hearing that the bhikṣu was ill, wept and shed tears and cried, ‘May this bhikṣu not die!’

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཡེ་ཤེས་སྟོབས་ལ་ལྷ་མོ་སྔོན་སྣག་གི་གཉེན་མཚམས་སུ་གྱུར་པ་ཞིག་ཡོད་དེ། དེ་རྒྱལ་པོ་དེའི་ཕྱི་བཞིན་འབྲང་བས་རྨི་ལམ་དུ་བསྟན་པ། རྒྱལ་པོ་ཆེན་པོ་གལ་ཏེ་དགེ་སློང་འདི་ལ་མིའི་ཤ་དང་ཁྲག་སར་པ་མ་རུལ་པས་འབྲུམ་བུ་མེ་དབལ་ནག་པོ་འདི་ལ་བྱུགས་ཏེ། མིའི་ཤ་སར་པ་མ་རུལ་པ་ལས་རོ་སྣ་ཚོགས་སུ་གཡོས་བྱས་ཏེ་བྱིན་ན་དགེ་སློང་འདི་ནད་འདི་ལས་འཚོ་བར་འགྱུར་རོ་ཞེས་ཟེར་རོ།
en: “Young man, at that time and in those days, the goddess of King Jñānabala’s family since ancient times, who was always by his side, instructed the king in a dream, saying, ‘Great king, if fresh, unspoiled human blood is applied to this bhikṣu’s erysipelas, and if fresh, untarnished human flesh is prepared with various flavors and given to him to eat, then this bhikṣu will be cured of his illness.’

source: །དེ་ནས་རྒྱལ་པོ་ཡེ་ཤེས་ཀྱི་སྟོབས་མཚན་མོ་དེ་འདས་པ་དང་གཉིད་ཀྱིས་ལོག་པ་ལས་སད་དེ་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་འོངས་ནས་རྨི་ལམ་གྱི་རྣམ་པ་དེ་དག་བཙུན་མོའི་འཁོར་རྣམས་ལ་བཟླས་ཏེ། ངའི་རྨི་ལམ་འདི་ལྟ་བུ་ཞིག་མཐོང་ངོ་ཞེས་བཟླས་ནས་གོ་བར་བྱས་ན།
en: When that night had passed and King Jñānabala awoke from his sleep he entered his harem and he described the dream to his harem, saying, ‘This is the kind of dream that I have had.’

source: གཞོན་ནུ་དེ་ལྟར་བུད་མེད་ཀྱི་ཁྱིམ་དེ་དང་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ནས་དགེ་སློང་དེ་ལ་རྩི་དེ་སྦྱིན་པར་སུ་ཡང་སྤྲོ་བ་མེད་དོ།
en: “Young man, none of the women in the harem, the king’s wives, had the fortitude to provide that remedy for the bhikṣu.

source: །རྒྱལ་པོའི་བུ་མོ་ཡེ་ཤེས་ལྡན་ཡང་རྨི་ལམ་དེ་ལྟ་བུ་ཞིག་རྨིས་ནས་སད་པ་དང་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་སོང་སྟེ། རྨི་ལམ་གྱི་རྣམ་པ་དེ་དག་མ་དང་ཞབས་འབྲིང་བ་རྣམས་ལ་གཏམ་བྱས་ཀྱང་དགེ་སློང་དེ་ལ་རྩི་དེ་སྦྱིན་པར་སུ་ཡང་སྤྲོ་བ་མེད་དོ།
en: “Princess Jñānāvatī also dreamed that kind of dream. When she awoke, she went into the harem and described the dream to her circle of mothers, but none of the women had the fortitude to provide that remedy for the bhikṣu.

source: །དེ་ནས་རྒྱལ་པོའི་སྲས་མོ་ཡེ་ཤེས་ལྡན་དེ་དགའ་ཞིང་མགུ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་བ་དང་མོས་པ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་འདི་ལྟ་བུར་བརྩོན་པར་བྱས་ཏེ།
en: “Then Princess Jñānāvatī became happy, delighted, thrilled, joyful, pleased, and glad, and made this resolution:

source: འདི་ལྟར་བདག་གིས་རྩི་འདི་དག་བདག་གི་ལུས་ལས་བཅད་དེ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་ཁྲག་སར་པ་དང་ཤ་སར་པ་སྦྱིན་པར་བྱའོ།
en: ‘In that case I shall cut from myself the remedy, and as instructed will give him the fresh blood and fresh flesh.

source: །རྒྱལ་པོའི་ཕོ་བྲང་ན་བདག་ནི་ཐམས་ཅད་ཀྱི་ནང་ན་གཞོན་ཞིང་ཆུང་སྟེ། ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན་ལ།
en: I am the youngest and least within the royal household, and my body, speech, and mind are untarnished.

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཡེ་ཤེས་བཙལ་བར་འདོད་པས་ཆོས་སྨྲ་བ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་ལ་བདག་གི་ལུས་ཀྱི་ཤ་དང་ཁྲག་ཕུལ་ཏེ། དགེ་སློང་འདི་ཅི་ནས་ནད་འདི་ལས་སོས་པར་བྱའོ་སྙམ་མོ།
en: I seek untarnished wisdom, and therefore I shall offer my flesh and blood to the untarnished dharmabhāṇaka, so that I may heal this bhikṣu of his illness!’

source: །དེ་ནས་རྒྱལ་པོའི་བུ་མོ་ཡེ་ཤེས་ལྡན་དེ་རང་གི་གནས་སུ་སོང་ནས་མཚོན་རྣོན་པོ་ཐོགས་ཏེ་ཆོས་ལ་ཞུགས་པའི་ཡིད་ཀྱིས་བདག་གི་བརླ་ལས་ཤ་བཅད་ནས།
en: “Then Princess Jñānāvatī returned to her own dwelling and, taking up a sharp knife and with her mind focused on the Dharma, she cut flesh from her own thigh.

source: རོ་སྣ་ཚོགས་དང་ལྡན་པ་གྱ་ནོམ་པར་གཡོས་བྱས་ནས།
en: She prepared it, adding various excellent flavors.

source: ཁྲག་ཀྱང་ཐོགས་ཏེ་འཕགས་པ་དེའི་དྲུང་དུ་སོང་ནས་རྒྱལ་པོ་ཡེ་ཤེས་སྟོབས་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཁྲག་གིས་འབྲུམ་བུ་མེ་དབལ་ནག་པོ་དེ་བྱུགས་ནས། གཡོས་ལེགས་པར་བྱས་པའི་ཟས་དེ་དགེ་སློང་དེ་ཟར་བཅུག་སྟེ།
en: Bringing the blood, too, she went to her ācārya and, seated before King Jñānabala, she applied the blood onto the black erysipelas and nourished the bhikṣu with the well-prepared meal.

source: འདྲངས་པར་བྱེད་ཅིང་ལེགས་པར་བསྟབས་སོ། །དེ་ནས་དགེ་སློང་དེ་མི་ཤེས་མ་རིག་མ་དོགས་པས་ཟས་དེ་ཟོས་སོ།
en: “Then the bhikṣu, not knowing, unaware, and unsuspecting, ate that food.

source: །ཟས་དེ་ཟོས་མ་ཐག་ཏུ་དགེ་སློང་དེའི་ན་ཚ་ཐམས་ཅད་མེད་པར་གྱུར་ཏེ་ནད་དེ་ཐམས་ཅད་ཀྱང་སོས་སོ།
en: As soon as he had eaten it, the bhikṣu’s illness completely vanished and he was entirely cured of his illness.

source: །དེ་ཡོངས་སུ་གདུང་བ་དང་བྲལ་ཞིང་བདེ་བ་དང་ལྡན་པས་དེ་ལྟ་དེ་ལྟ་བུར་ཆོས་བསྟན་ཏེ། བཙུན་མོའི་འཁོར་དེ་དང་གྲོང་པ་དང་ཡུལ་མི་དང་ཡུལ་འཁོར་བ་འདུས་པ་དེ་དག་ལས་སྲོག་ཆགས་ཁྲི་ཉིས་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: Freed from pain and happy, he taught the Dharma so that twelve hundred beings from among the harem and the assembled people from the land, towns, and countryside developed the aspiration to highest, complete enlightenment.

source: །དེ་ནས་རྒྱལ་པོ་ཡེ་ཤེས་སྟོབས་ཀྱིས་བདག་གི་བུ་མོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: “King Jñānabala then recited these verses to his daughter:

source: །བུ་མོ་ཁྱོད་ཀྱིས་ཁྲག་འདི་ག་ལས་རྙེད།
en: “ ‘Daughter, from where did you obtain this blood?

source: །མི་ཡི་ཤ་འདི་དག་ཀྱང་གང་ནས་བླངས།
en: And from where did you obtain this human flesh?

source: །བུ་མོ་ཁྱོད་ཀྱིས་ཁ་ཟས་འདི་བྱས་པས།
en: Daughter, by your preparing this food

source: །ཆོས་སྨྲ་འདི་ཡང་འདི་ལྟར་བདེ་བར་གྱུར། །སྣ་ཚོགས་བྲོ་དང་ལྡན་པའི་གཡོས་བྱས་པ། །བསད་པ་ཡིན་ནམ་དེ་སྟེ་ཤི་བ་རྙེད།
en: The dharmabhāṇaka has become healthy. {1} “ ‘Was it from someone slain or who had died that you obtained This flesh prepared with various flavors?

source: །དེས་ནི་སྡིག་པའི་ནད་ལས་འདི་ཐར་བྱས།
en: That has freed him from this evil sickness?’ {2}

source: །བུ་མོ་དེས་ནི་ཕ་ཡི་ཚིག་ཐོས་ནས།
en: “The daughter listened to her father’s words

source: །བུ་མོ་ཡེ་ཤེས་ལྡན་གྱིས་འདི་སྐད་སྨྲས།
en: And Jñānāvatī then addressed him.

source: །ཞུམ་སེམས་མེད་པར་ཚིག་ཀྱང་རབ་སྨྲས་ཏེ།
en: With no despondency, she spoke these words:

source: །བདག་ནི་ཅི་མཆི་ཡབ་ཁྱོད་གསན་དུ་གསོལ།
en: ‘Listen, father, to what I have to say. {3}

source: །ལྷ་ཡིས་བསྟན་པའི་རྨི་ལམ་དག །བདག་གིས་མཐོང་བར་གྱུར་ཏོ་ཡབ།
en: “ ‘I too, father, had the dream That was sent by the goddess.

source: །ས་ཡི་བདག་པོ་བདག་ལ་གསོན།
en: Lord of the World, listen to me,

source: །ཡང་དག་དོན་ནི་མཁྱེན་པར་མཛོད།
en: And understand its true meaning. {4}

source: །ལྷ་དེས་བདག་ལ་འདི་སྐད་སྟོན།
en: “ ‘That goddess said to me That whoever gives to the bhikṣu

source: །མི་ཡི་ཤ་དང་ཁྲག་རྣམས་ནི། །དགེ་སློང་འདི་ལ་སུས་བྱིན་ན།
en: The flesh and blood of a human

source: །སྡིག་པའི་ནད་ལས་ཐར་བར་འགྱུར།
en: Will cure him of his evil illness. {5}

source: །བདག་ནི་མལ་ནས་ལངས་ནས་སུ།
en: “ ‘I arose from my bed

source: །བཙུན་མོའི་འཁོར་དུ་མཆིས་ནས་ནི།
en: And I entered the harem.

source: །བདག་གིས་དེ་ཚེ་རྨི་ལམ་རྣམས།
en: I then related my dream

source: །མ་ཡི་གཙོ་ལ་བཟླས་ཤིང་སྨྲས།
en: To my superiors, my mothers. {6}

source: །བྲན་མོ་རྣམས་ལ་བདག་གིས་བསྒོ།
en: “ ‘I asked the servants who among them

source: །འདི་ལྟ་བུ་དག་སུ་བྱེད་ནུས།
en: Would be able to do this, To make perfectly delicious

source: །མི་ཡི་ཁྲག་དང་ཤ་རྣམས་ནི། །ཁུ་བར་བཙོས་པ་གཡོས་བྱས་ཏེ།
en: Human blood and flesh? {7}

source: །ཟས་སུ་རབ་ཏུ་སྦྱིན་བྱ་ཞིང་།
en: “ ‘If that food is given to him

source: །ཁྲག་དག་གིས་ཀྱང་བྱུགས་ནས་སུ།
en: And if the blood is applied, The bhikṣu will be freed

source: །མེ་དབལ་ནག་པོ་འདི་ལས་ཀྱང་། །དགེ་སློང་ཇི་ལྟར་ཐར་བར་བྱ།
en: From this black erysipelas. {8}

source: །ཆོ་ག་མྱུར་དུ་མ་བྱས་ན།
en: “ ‘If we do not use this method,

source: །རྩི་སྨན་དག་ནི་མ་བྱས་པས།
en: If we do not apply this remedy,

source: །དགེ་སློང་འདི་ནི་ནད་འདི་ཡིས། །མྱུར་དུ་འཆི་བའི་དུས་བྱེད་འགྱུར།
en: This bhikṣu will soon die Because of this illness that he has. {9} “ ‘What being in the three existences

source: །རང་གི་ཤ་དང་ཁྲག་གཏོང་བ། །སྲིད་པ་གསུམ་ན་སེམས་ཅན་གང་།
en: Would not give their flesh and blood?

source: །མཁས་པ་སུ་ཞིག་འདི་མཐོང་ནས།
en: What wise ones on seeing this

source: །ལུས་ལ་ཡང་ནི་གནས་པར་བྱེད།
en: Would hold fast to their body? {10}

source: །བཙུན་མོའི་འཁོར་དུ་བདག་གིས་གོ་བར་བགྱིས།
en: “ ‘Though I told the harem of this,

source: །བུད་མེད་གཅིག་ཀྱང་སྦྱིན་ཞེས་མི་མཆི་ནས།
en: Not even one woman said she would give.

source: །བདག་ལ་དགེ་སློང་དེ་ཕངས་བདག་ཕངས་ཀྱང་།
en: The bhikṣu is beloved and he is beloved by me,

source: །བྱང་ཆུབ་ཕྱིར་ནི་བདག་གིས་ཤ་ཁྲག་བཏང་།
en: So I gave him my flesh and blood for the sake of enlightenment. {11}

source: །བྱང་ཆུབ་ཞི་བ་མྱ་ངན་མེད་ཚོལ་བ།
en: “ ‘Those who seek enlightenment, peace, and freedom from misery

source: །དེ་དག་ལུས་ལ་མོས་ཤིང་རྟེན་པ་མིན།
en: Have no devotion to their body or dependence on it;

source: །བདག་ཉིད་ལ་ཡང་རྡུལ་ཙམ་ཕངས་པ་མེད།
en: Of themselves they cherish not even an atom,

source: །བདག་ཉིད་བཏང་ཡང་ཡིད་ནི་མི་དགའ་མེད།
en: And are not saddened to give themselves away. {12}

source: །བཙུན་མོའི་འཁོར་རྣམས་དེ་ཐོས་ནས།
en: “ ‘When the harem heard those words,

source: །ཐམས་ཅད་རྨུགས་པ་བཞིན་དུ་གྱུར།
en: They were all perplexed. None of them had the fortitude

source: །བྱ་བ་དེ་དག་སྦྱར་བར་ནི། །སུ་ཡང་སྤྲོ་བར་མ་གྱུར་ཏོ།
en: To take on such an act. {13}

source: །དེ་ནས་བདག་གི་སེམས་སྐྱེས་པ།
en: “ ‘Then I developed the intention

source: །དགེ་སློང་འདི་ནི་ཟས་བྱིན་ཏེ།
en: That I would provide the food for the bhikṣu,

source: །བདག་གི་ཤ་ཡང་བཅད་ནས་ནི།
en: Cutting off pieces of my own flesh

source: །ཁྲག་རྣམས་ཀྱིས་ཀྱང་བསྐུ་བར་བྱ།
en: And using for lotion my own blood. {14}

source: །བདག་གི་བརླ་ལས་ཤ་བཅད་དེ།
en: “ ‘I cut into my own thighs

source: །ཤ་རྣམས་དང་ནི་ཁྲག་བླངས་ནས།
en: And obtained the flesh and blood.

source: །ཤ་ཡི་སྣ་གུ་བདག་གིས་བསྐལ།
en: I myself cooked the pieces of flesh

source: །བྲོ་བ་སྣ་ཚོགས་གཡོས་ལེགས་བགྱིས།
en: And added various flavorings. {15} “ ‘In the presence of my father

source: །དགེ་སློང་ན་བ་དེ་ལ་ནི།
en: I gave to the sick bhikṣu

source: །མི་ཤ་ཡི་ནི་ཁ་ཟས་དང་། །ཁྲག་རྣམས་ཀྱིས་ཀྱང་བྱུག་པ་དག །བདག་གིས་ཡབ་ཀྱི་སྤྱན་སྔར་སྩལ།
en: The meal of human flesh And the lotion of blood. {16}

source: །མི་ཡི་བདག་པོ་བདག་གི་ཚིག་ལ་གསོན།
en: “ ‘Lord of men, listen to my words!

source: །ས་བདག་མི་ཤ་དག་ནི་མ་རྙེད་ནས།
en: Sovereign, there not being any human flesh,

source: །བདག་གི་བརླ་ལས་ཤ་དག་བཅད་ནས་སུ།
en: I cut the flesh from my own thighs,

source: །དེ་བསྒྲུབས་ཆོས་སྨྲ་འདི་ལ་སྩལ་པ་ལགས།
en: And having cooked it gave it to the dharmabhāṇaka. {17}

source: །བདག་གིས་བླ་མེད་བྱང་ཆུབ་དོན་ཕྱིར་དུ།
en: “ ‘It was for the sake of the highest enlightenment

source: །རང་གི་ལུས་ཀྱིས་དོན་ཆེན་འདི་དག་བགྱིས།
en: That I accomplished this great purpose with my body.

source: །དགེ་སློང་འདི་ཡང་ཐར་བགྱིས་མི་བདེ་མེད།
en: The bhikṣu is cured and returned to health

source: །བདག་གི་བསོད་ནམས་དག་ནི་ཚད་མེད་བགྱིས།
en: And I have created immeasurable merit.’ {18}

source: །བུ་མོ་དེ་ལ་རྒྱལ་པོས་འདི་སྐད་སྨྲས། །བུ་མོ་ཁྱོད་ཀྱིས་རྩིར་ནི་བྱ་བའི་ཕྱིར།
en: “The king inquired of his daughter,

source: །ཇི་ལྟར་ལུས་ལས་རང་གི་ཤ་བཅད་ན།
en: ‘How did you cut the flesh from your body? Daughter, when you engaged in creating this remedy,

source: །ཁྱོད་ཀྱི་ལུས་ལ་ན་ཚར་མ་གྱུར་ཏམ།
en: Did you not suffer from physical pain?’ {19}

source: །རྒྱལ་པོའི་བུ་མོ་བློ་ལྡན་འཇིགས་མེད་པས།
en: “The wise and fearless princess replied to him,

source: །དེ་ཚེ་སྨྲས་པ་རྒྱལ་པོ་ས་བདག་གསོན།
en: ‘King, lord of the earth, listen!

source: །ལས་ཀྱི་རྣམ་སྨིན་བསམ་ཡས་དེ་འདྲ་བས། །དེ་དག་གསན་ནས་ཚུལ་བཞིན་མཁྱེན་པར་མཛོད།
en: Having listened, understand correctly The inconceivable ripening of karma. {20}

source: །ཡབ་ཅིག་སྡིག་པའི་ལས་རྣམས་བགྱིས་པ་ཡིས།
en: “ ‘Father, through having done bad actions,

source: །སེམས་ཅན་སེམས་དམྱལ་མི་བཟད་ལྟུང་གྱུར་ཏེ།
en: Beings fall into dreadful hell.

source: །ཤ་མེད་གྱུར་ནས་ཕྱིར་ཡང་ཤ་དག་སྐྱེ།
en: They lose their flesh, and again have flesh.

source: །ལས་ཀྱི་འབྲས་བུ་བསམ་གྱིས་མི་ཁྱབ་གཟིགས།
en: See the inconceivable result of actions! {21}

source: །སྡིག་པའི་ལས་ཀྱིས་ཤ་ཁྲག་མེད་གྱུར་ཅིང་།
en: “ ‘Through bad karma they have no flesh or blood,

source: །སྐད་ཅིག་ཏུ་ཡང་ཤ་ཁྲག་འབྱུང་འགྱུར་ན།
en: And in an instant they again have flesh and blood.

source: །དགེ་བའི་ལས་དང་མོས་པ་དེ་དག་ལས།
en: Therefore, needless to say that, because of good karma,

source: །ཤ་དང་ཁྲག་རྣམས་སྐྱེ་བ་སྨོས་ཅི་འཚལ།
en: Through aspiration flesh and blood will be created. {22}

source: །ཤ་བཅད་བདག་ལ་ན་ཚ་མ་མཆིས་ཏེ།
en: “ ‘I had no pain when I cut my flesh.

source: །ཁྲག་ཕྱུང་བདག་ལ་གཡོ་བ་ཡོང་མ་མཆིས།
en: When the blood flowed I did not become dizzy.

source: །བདག་གི་ཤ་རྣམས་ཐམས་ཅད་བཅད་ན་ཡང་།
en: Even if I were to cut off all of my flesh,

source: །ཆོས་ཀྱི་ལུས་ལ་རྨ་དང་སྐྱོན་མ་མཆིས།
en: The body of the Dharma would have no wound or cut. {23}
